gdgly/powerPack/libraries/boot_rom/f28004x/revA/rom_sources/F28004x_ROM/inc/hw_lin.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SCIPIO7 register
//
//*****************************************************************************
#define LIN_SCIPIO7_RXPD          0x2U        // SCIRX pin pull control
#define LIN_SCIPIO7_TXPD          0x4U        // SCITX pin pull control

//*****************************************************************************
//
// The following are defines for the bit fields in the SCIPIO8 register
//
//*****************************************************************************
#define LIN_SCIPIO8_RXPSL         0x2U        // SCIRX pin pull type
#define LIN_SCIPIO8_TXPSL         0x4U        // SCITX pin pull type

//*****************************************************************************
//
// The following are defines for the bit fields in the LINCOMP register
//
//*****************************************************************************
#define LIN_COMP_SBREAK_S         0U
#define LIN_COMP_SBREAK_M         0x7U        // Synch Break Extend
#define LIN_COMP_SDEL_S           8U
#define LIN_COMP_SDEL_M           0x300U      // Sync Delimiter Compare

//*****************************************************************************
//
// The following are defines for the bit fields in the LINRD0 register
//
//*****************************************************************************
#define LIN_RD0_RD3_S             0U
#define LIN_RD0_RD3_M             0xFFU       // Receive Buffer 3
#define LIN_RD0_RD2_S             8U
#define LIN_RD0_RD2_M             0xFF00U     // Receive Buffer 2
#define LIN_RD0_RD1_S             16U
#define LIN_RD0_RD1_M             0xFF0000U   // Receive Buffer 1
#define LIN_RD0_RD0_S             24U
#define LIN_RD0_RD0_M             0xFF000000U // Receive Buffer 0

//*****************************************************************************
//
// The following are defines for the bit fields in the LINRD1 register
//
//*****************************************************************************
#define LIN_RD1_RD7_S             0U
#define LIN_RD1_RD7_M             0xFFU       // Receive Buffer 3
#define LIN_RD1_RD6_S             8U
#define LIN_RD1_RD6_M             0xFF00U     // Receive Buffer 2
#define LIN_RD1_RD5_S             16U
#define LIN_RD1_RD5_M             0xFF0000U   // Receive Buffer 1
#define LIN_RD1_RD4_S             24U
#define LIN_RD1_RD4_M             0xFF000000U // Receive Buffer 0

//*****************************************************************************
//
// The following are defines for the bit fields in the LINMASK register
//
//*****************************************************************************
#define LIN_MASK_TXIDMASK_S       0U
#define LIN_MASK_TXIDMASK_M       0xFFU       // TX ID Mask bits (LIN only)
#define LIN_MASK_RXIDMASK_S       16U
#define LIN_MASK_RXIDMASK_M       0xFF0000U   // RX ID Mask bits (LIN only)

//*****************************************************************************
//
// The following are defines for the bit fields in the LINID register
//
//*****************************************************************************
#define LIN_ID_IDBYTE_S           0U
#define LIN_ID_IDBYTE_M           0xFFU       // LIN message ID (LIN only)
#define LIN_ID_IDSLAVETASKBYTE_S  8U
#define LIN_ID_IDSLAVETASKBYTE_M  0xFF00U     // Received ID comparison ID
                                              // (LIN only)
#define LIN_ID_RECEIVEDID_S       16U
#define LIN_ID_RECEIVEDID_M       0xFF0000U   // Current Message ID (LIN only)

//*****************************************************************************
//
// The following are defines for the bit fields in the LINTD0 register
//
//*****************************************************************************
#define LIN_TD0_TD3_S             0U
#define LIN_TD0_TD3_M             0xFFU       // TRANSMIT Buffer 3
#define LIN_TD0_TD2_S             8U
#define LIN_TD0_TD2_M             0xFF00U     // TRANSMIT Buffer 2
#define LIN_TD0_TD1_S             16U
#define LIN_TD0_TD1_M             0xFF0000U   // TRANSMIT Buffer 1
#define LIN_TD0_TD0_S             24U
#define LIN_TD0_TD0_M             0xFF000000U // TRANSMIT Buffer 0

//*****************************************************************************
//
// The following are defines for the bit fields in the LINTD1 register
//
//*****************************************************************************
#define LIN_TD1_TD7_S             0U
#define LIN_TD1_TD7_M             0xFFU       // TRANSMIT Buffer 7
#define LIN_TD1_TD6_S             8U
#define LIN_TD1_TD6_M             0xFF00U     // TRANSMIT Buffer 6
#define LIN_TD1_TD5_S             16U
#define LIN_TD1_TD5_M             0xFF0000U   // TRANSMIT Buffer 5
#define LIN_TD1_TD4_S             24U
#define LIN_TD1_TD4_M             0xFF000000U // TRANSMIT Buffer 4

//*****************************************************************************
//
// The following are defines for the bit fields in the MBRSR register
//
//*****************************************************************************
#define LIN_MBRSR_MBR_S           0U
#define LIN_MBRSR_MBR_M           0x1FFFU     // Received Data.

//*****************************************************************************
//
// The following are defines for the bit fields in the IODFTCTRL register
//
//*****************************************************************************
#define LIN_IODFTCTRL_RXPENA      0x1U        // Analog Loopback Via Receive
                                              // Pin Enable
#define LIN_IODFTCTRL_LPBENA      0x2U        // Module Loopback Enable
#define LIN_IODFTCTRL_IODFTENA_S  8U
#define LIN_IODFTCTRL_IODFTENA_M  0xF00U      // IO DFT Enable Key
#define LIN_IODFTCTRL_TXSHIFT_S   16U
#define LIN_IODFTCTRL_TXSHIFT_M   0x70000U    // Transmit Delay Shift
#define LIN_IODFTCTRL_PINSAMPLEMASK_S  19U
#define LIN_IODFTCTRL_PINSAMPLEMASK_M  0x180000U   // TX Pin Sample Mask
#define LIN_IODFTCTRL_BRKDTERRENA  0x1000000U  // Break Detect Error Enable
                                              // (SCI compatibility mode)
#define LIN_IODFTCTRL_PERRENA     0x2000000U  // Parity Error Enable (SCI
                                              // compatibility mode)
#define LIN_IODFTCTRL_FERRENA     0x4000000U  // Frame Error Enable (SCI
                                              // compatibility mode)
#define LIN_IODFTCTRL_ISFERRENA   0x10000000U // Inconsistent Synch Field
                                              // Error Enable (LIN mode)
#define LIN_IODFTCTRL_CERRENA     0x20000000U // Checksum Error Enable(LIN
                                              // mode)
#define LIN_IODFTCTRL_PBERRENA    0x40000000U // Physical Bus Error Enable
                                              // (LIN mode)
#define LIN_IODFTCTRL_BERRENA     0x80000000U // Bit Error Enable (LIN mode)

//*****************************************************************************
//
// The following are defines for the bit fields in the LIN_GLB_INT_EN register
//
//*****************************************************************************
#define LIN_GLB_INT_EN_GLBINT0_EN  0x1U        // Global Interrupt Enable for 
                                              // LIN INT0
#define LIN_GLB_INT_EN_GLBINT1_EN  0x2U        // Global Interrupt Enable for 
                                              // LIN INT1

//*****************************************************************************
//
// The following are defines for the bit fields in the LIN_GLB_INT_FLG register
//
//*****************************************************************************
#define LIN_GLB_INT_FLG_INT0_FLG  0x1U        // Global Interrupt Flag for LIN
                                              // INT0
#define LIN_GLB_INT_FLG_INT1_FLG  0x2U        // Global Interrupt Flag for LIN
                                              // INT1

//*****************************************************************************
//
// The following are defines for the bit fields in the LIN_GLB_INT_CLR register
//
//*****************************************************************************
#define LIN_GLB_INT_CLR_INT0_FLG_CLR  0x1U        // Global Interrupt flag clear
                                              // for LIN INT0
#define LIN_GLB_INT_CLR_INT1_FLG_CLR  0x2U        // Global Interrupt flag  clear
                                              // for LIN INT1
#endif
